In [3]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None) #Para que printee todas las columnas
pd.set_option('display.max_rows', None)

In [4]:
actor = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\actor.csv")

In [5]:
category = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\category.csv")

In [6]:
film = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\film.csv")

In [7]:
inventory = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\inventory.csv")

In [8]:
language = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\language.csv")

In [9]:
old_HD = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\old_HDD.csv")

In [10]:
rental = pd.read_csv("C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\data\\rental.csv")

In [11]:
actor.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [12]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [13]:
actor['name'] = actor['first_name']+ " "+actor['last_name']
actor.drop(['first_name', 'last_name'], axis=1, inplace= True)
actor = actor[['actor_id', 'name', 'last_update']]
actor.drop(['last_update'], axis=1, inplace= True)
actor.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [14]:
category.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [15]:
category.drop(['last_update'], axis=1, inplace=True)
category.rename(columns={'name': 'genre'}, inplace=True)
category.head()

   category_id      genre
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [16]:
catduplicates= category.duplicated()
totduplica= sum(catduplicates)
print(totduplica)

0

In [17]:
film.info(memory_usage="deep") #detecto una columna entera de nulos, drop it

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [18]:
#film.drop('original_language_id', axis=1, inplace=True)
#film.language_id.info(memory_usage="deep") 
#solo hay un valor (1) que identifica el lenguaje por tanto todas las peliculas o estan en el mismo idioma o el dato esta mal con lo que la columna no nos sirve tampoco.

In [19]:
film.drop('language_id', axis=1, inplace=True)

In [20]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   original_language_id  0 non-null      float64
 5   rental_duration       1000 non-null   int64
 6   rental_rate           1000 non-null   float64
 7   length                1000 non-null   int64
 8   replacement_cost      1000 non-null   float64
 9   rating                1000 non-null   object
 10  special_features      1000 non-null   object
 11  last_update           1000 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [43]:
#film.drop(['release_year', 'last_update'], axis=1, inplace=True)
#film.rename(columns={'length': 'film_duration'}, inplace=True)
#film.drop(['original_language_id'], axis=1, inplace=True)
film.head()

,film_id,title,description,rental_duration,rental_rate,film_duration,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

In [22]:
filmduplicates= film.duplicated()
totfduplica= sum(filmduplicates)
print(totfduplica)

0

In [23]:
inventory.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [24]:
inventory.drop(['last_update'], axis=1, inplace=True)
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [25]:
invduplicates= inventory.duplicated()
totiduplica= sum(invduplicates)
print(totiduplica)

0

In [26]:
language.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [27]:
#language.drop(['last_update'], axis= 1, inplace=True)
#language.rename(columns={'name': 'lang'}, inplace=True)
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [28]:
landuplicates= language.duplicated()
totlduplica= sum(landuplicates)
print(totlduplica)

0

In [29]:
old_HD.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [30]:
old_HD.head() #Voy a crear una columna nueva que sea el nombre y apellido juntos y eliminar las dos que hay.

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [31]:
film.columns

Index(['film_id', 'title', 'description', 'release_year',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [32]:
old_HD.columns

Index(['first_name', 'last_name', 'title', 'release_year', 'category_id'], dtype='object')

In [33]:
film.head()

,film_id,title,description,release_year,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [53]:
#old_HD['name'] = old_HD['first_name']+ " "+old_HD['last_name']
#old_HD.drop(['first_name', 'last_name'], axis=1, inplace= True)
#old_HD.drop(['release_year'], axis=1, inplace= True)
#old_HD = old_HD[['name', 'title', 'category_id']]
#old_HD['film_id'] = film['film_id'].copy() 
#old_HD = old_HD.merge(film, on=(['film_id']), how='left')
old_HD.head()

,name,title_x,category_id,film_id,title_y,description,rental_duration,rental_rate,film_duration,replacement_cost,rating,special_features
0,PENELOPE GUINESS,ACADEMY DINOSAUR,6,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,PENELOPE GUINESS,ACE GOLDFINGER,2,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,PENELOPE GUINESS,ADAPTATION HOLES,13,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,PENELOPE GUINESS,AFFAIR PREJUDICE,10,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,PENELOPE GUINESS,AFRICAN EGG,14,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

In [35]:
oldduplicates= old_HD.duplicated()
totoduplica= sum(oldduplicates)
print(totoduplica)

0

In [36]:
rental.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [37]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [38]:
rentduplicates= rental.duplicated()
totrduplica= sum(rentduplicates)
print(totrduplica)

0

In [39]:
actor.head()

   actor_id                 name
0         1     PENELOPE GUINESS
1         2        NICK WAHLBERG
2         3             ED CHASE
3         4       JENNIFER DAVIS
4         5  JOHNNY LOLLOBRIGIDA

In [44]:
film.head()

,film_id,title,description,rental_duration,rental_rate,film_duration,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

In [45]:
category.head()

   category_id      genre
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [73]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [56]:
#old_HD.drop(['title_x', 'title_y', 'description', 'rental_duration', 'rental_rate', 'film_duration', 'replacement_cost', 'rating', 'special_features'], axis=1, inplace=True)
old_HD = old_HD[['name', 'film_id', 'category_id']]
old_HD.head()

               name  film_id  category_id
0  PENELOPE GUINESS        1            6
1  PENELOPE GUINESS        2            2
2  PENELOPE GUINESS        3           13
3  PENELOPE GUINESS        4           10
4  PENELOPE GUINESS        5           14

In [58]:
#actor.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\actor_net.csv', index=False)

In [59]:
#film.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\film_net.csv', index=False)

In [60]:
#category.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\category_net.csv', index=False)

In [61]:
#inventory.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\inventory_net.csv', index=False)

In [62]:
#old_HD.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\old_HD_net.csv', index=True)

In [67]:
old_HD.head()

               name  film_id  category_id  inventory_film_id
0  PENELOPE GUINESS        1            6                  1
1  PENELOPE GUINESS        2            2                  2
2  PENELOPE GUINESS        3           13                  3
3  PENELOPE GUINESS        4           10                  4
4  PENELOPE GUINESS        5           14                  5

In [72]:
#old_HD.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\old_HD_net3.csv', index=False)

In [66]:
#old_HD = old_HD.assign(inventory_film_id=old_HD['film_id'])

In [68]:
film.head()

,film_id,title,description,rental_duration,rental_rate,film_duration,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,2.99,130,22.99,G,Deleted Scenes

In [69]:
#film.to_csv('C:\\Users\\Lorenzo\\Desktop\\IRONHACK REPOSITORIES\\w3-project_SQL\\csv_limpios\\film_net2.csv', index=False)